def f(s, c, m):
    # 129 - условие победы, в задаче написано
    if s >= 129:
        return c % 2 == m % 2
    if c == m:
        return False
    # все возможные ходы из текущего значения s,
    # их нужно отредактировать в зависимости от условий задачи
    h = [
        f(s + 1, c + 1, m),
        f(s * 2, c + 1, m)
    ]
    return any(h) if (c + 1) % 2 == m % 2 else all(h)


# в условии записано 1 <= s <= 128
for s in range(1, 128 + 1):
    for m in range(1, 4 + 1):
        if f(s, 0, m):
            print(s, m)
            break

# m == 1 - это Петя выиграл игру 1м ходом
# m == 2 - это Ваня выиграл игру 1м ходом
# m == 3 - это Петя выиграл игру 2м ходом
# m == 4 - это Ваня выиграл игру 2м ходом